<template>
  <view id="template">
    <view class="content">
      <text>
        欢迎您使用小程序服务（以下简称“本小程序”），请您在使用本小程序服务并注册成为小程序用户之前，务必仔细阅读并理解本协议中列明的服务条款。请您知悉，当您点击“同意”按钮后，即代表您已完全理解并接受本协议中的全部内容，本协议即成为对协议双方都具有约束力的法律文件。
        1、归属于“北京诚运云供应链管理有限公司”。
        2、有权根据自身业务及运营需要，依照国家法律法规，不定时对本协议条款及相关规则进行修改，修改后的内容，将在本小程序上公布并取代此前的相关内容，您可随时在小程序上浏览相关条款。如您不同意修改内容，您应立即停止使用本小程序及相关服务；如您继续使用本小程序及相关服务，即视为您已知悉修改内容并同意接受。
        3、本协议内容包括协议正文及所有已经发布或将发布的各项规则，您可以随时在本小程序上了解相关内容。所有规则都是本协议不可分割的一部分，与本协议具体同等的法律效力。
        4、您已知悉，仅提供信息撮合和交易等服务，在使用本小程序服务时所需的设备及费用应由您自行承担。
        （1）使用本小程序服务所需设备包括：个人电脑、手机、路由器等；
        （2）使用本小程序服务需自行承担的费用包括：电话费、上网费等。 二、用户条款 1、用户注册
        （1）请您按照本小程序注册页面提示正确填写信息、设置密码，并认真阅读理解并同意本协议后，即可注册成为本小程序用户。您注册时填写的用户名及设置的密码即代表你在本小程序的用户身份，您应自行对您注册的账户和密码的安全负责且对该账户进行的所有活动和事件负责，妥善保管并合理使用。如您发现您的注册账户或密码存在被盗用或其他任何安全漏洞，请您立即通告本小程序。您理解对用户告知的任何需求采取行动都需要合理时间，对采取行动前已经产生的后果不承担任何责任。
        （2）请您在进行注册时，填写的信息应准确、真实、有效，您应对您填写信息的真实性、有效性、准确性及可能产生的后果负责。如您提供的资料不真实、不完整、不准确或有合理理由怀疑该资料不真实、不完整、不准确或包含违反国家法律法规的内容，有权暂停或终止您的注册行为，并拒绝您以任何形式使用本小程序服务。
        （3）您已知悉并同意，本小程序在您注册时，您填写的注册信息可能包括您的个人信息，本小程序可以采集并存储的您的个人信息，包括但不限于：真实姓名、身份证号码、性别、配送地址、住址、电子邮箱地址、联系方式、定位信息、相册等。本小程序除法律规定情形外，未经您的许可，以上信息不会向第三方公开透漏，将利用合理措施保证您个人信息的安全。
        2、使用规则 请您在使用本小程序及相关服务时，遵循如下规则： （1）遵守国家、地方法律法规；
        （2）遵守本小程序服务协议及相关规则；
        （3）不得通过本小程序服务，发布、传播或展示任何反动、虚假、辱骂、庸俗淫秽、欺诈、骚扰或其他非法的任何信息；
        （4）不得通过本小程序服务发布侵犯他人隐私、著作权、商标权等知识产权或其他合法权利的信息；
        （5）不得将本小程序服务用于任何非法用途； （6）不得进行有损本小程序利益的行为；
        （7）不得将注册的账号、密码转给他人使用； （8）不得将注册的账号当做商品进行交易；
        （9）不得通过盗取、诈骗等非法手段获取注册账户及密码；
        （10）使用完本小程序服务，请您正确的步骤离开小程序，并注销您的账户；
        （11）允许通过电子邮件、小程序站内通知、站内信、手机短信或其他方式向注册用户发送与服务相关的任何信息。
        3、停止服务
        您或可随时根据实际情况停止本小程序服务。如您对的服务不满，或者您对本协议修改后的内容有异议，可以选择：
        （1）停止使用小程序服务； （2）通告停止对您的服务并注销您的注册账户。 三、知识产权
        1、小程序内所有的内容，包括所有的文字、图片、图像、图形、音频、视频等都是本小程序财产，上述内容所具有的版权、商标权等知识产权及其他相关所有权都受法律保护，未经本小程序同意，任何个人或企业均无权复制、下载、传输或提供给任何第三方。如违反上述要求的并给本小程序及本小程序所属公司造成损失的，本小程序及公司有权依法追究其法律责任。
        2、为提供服务而提供给注册用户使用的任何软件、APP的一切所有权及其他财产权利都属于软件著作权人所有，未经许可，任何个人或企业不得对前述软件、APP进行反向工程、编译或汇编。
        3、任何注册用户不得在本小程序发布、传播、展示侵犯他人知识产权的信息或内容，如发生任何侵权行为，该用户应承担相应侵权法律责任，对用户侵权行为不承担任何责任。
        四、通知及送达 1、将通过本小程序公告、站内信、电子邮件、手机短信等方式向注册用户推送各
        项通知、通告，前述通知、通告于发布或发送之日即视为送达。
        2、通过电子邮件、手机短信等方式推送的通告，该电子邮件、手机号码是指您在本小程序上自行填写的个人信息，如您的相关资料发生变更，请您及时在本小程序个人信息页面更新，如因您未更新信息导致无法收到发送给您的通告的，及本小程序不承担相关责任。
        五、免责条款 1、您同意使用提供的服务所存在的风险及产生的一切后果由用户自行承担。
        2、您同意妥善保管自己的注册账户及密码，如因您自身原因将注册账户及密码告知他人，转让或出借账户给他人使用，由此导致的个人信息泄露、配送货品丢失或其他损失由您自行承担，不承担任何责任。
        3、您同意向及本小程序提供的信息都是真实、完整、准确的，如因您提供的信息不真实、不完整、不准确或存在其他问题造成无法使用本小程序服务或其他损失，不承担任何责任。
        4、上的用户发布、展示、上传的任何信息都是用户的个人行为，不代表的任何立场，如您因使用其他用户提供的信息而造成任何损害或损失的，不承担任何责任。如前述信息为违法信息或侵犯您的权益，您可向通知举报，将协助保留相关证据材料。
        5、不担保本小程序所提供的服务一定能满足或符合您的要求，也不担保服务的及时性、安全性及可能发生的错误或中断。
        6、有义务保证本小程序正常运行，并及时对小程序进行更新、修正、完善。但因不可抗力因素导致本小程序出现的任何服务中断或其他问题，不承担任何责任，但本小程序会尽力修正并减少因此给用户造成的损失或影响。
        7、向您发送的通知、通告，如因不可抗力或非本小程序原因造成无法及时、准确送达的，无需承担任何责任。 六、违约责任
        1、如您违反本协议约定或涉及违反法律法规的（发现或经他人举报投诉），有权不经通知随时停止本小程序对您的服务，并立即对涉及违规的内容进行删除、屏蔽，对违规的账户处以包括但不限于警告、限制或停止提供部分或全部服务、账户封禁、账户注销等处罚，并公示处理结果。
        2、如因您违反本协议或其他相关规则，侵犯其他第三方权益从而导致的任何索赔、赔偿、诉讼、投诉的，您应自行承担相应责任，如因此造成损失的，您也应承担相应赔偿责任。
        3、如您在本小程序的任何行为涉及违反国家、地方法律法规，或发现您利用本小程序从事任何违法犯罪活动的，有权采取适当的法律行动，依据法律规定保存相关违法信息及证据材料并向有关部门进行报告，您应独立承担由此产生的一切法律责任。
        七、法律管辖及适用 1、本协议及相关规则均适用中华人民共和国法律管辖。
        2、本协议双方如就协议内容或执行发生任何争议，应协商解决；协商不成的，任何一方均可向及所属公司所在地人民法院提起诉讼。
        3、本协议中任何一条废止、无效不代表整个协议的废止或无效。其他任何条款仍继续有效。
        4、请您仔细阅读本协议及相关规则（如有），在您点击“同意”后，即视为您完全接受本协议内容，请您在点击之前再次确认已完全了解及理解本协议及相关规则（如有）的全部内容。
      </text>
    </view>
  </view>
</template>
<script>
export default {
  data() {
    return {}
  },
  methods: {},
  mounted() {}
}
</script>
<style lang="scss" scoped>
.content {
  margin: 40rpx;
}
text {
  font-size: 28rpx;
  font-family: PingFangSC-Regular, PingFang SC;
  font-weight: 400;
  color: #1a2234;
}
</style>
